01-Sim/sphereQuad/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2.0;
    format          ascii;
    class           dictionary;
    object          blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1000;

vertices
(
    (  -5   0  -5 )
    (   0   0  -5 )
    (   0   5  -5 )
    (  -5   5  -5 )
    (  -5   0   5 )
    (   0   0   5 )
    (   0   5   5 )
    (  -5   5   5 )

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (50 50 100) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (4 5 6 7)
        );
    }
    outlet
    {
        type patch;
        faces
        (
            (0 3 2 1)
        );
    }
    externalFlow
    {
        type wall;
        faces
        (
            (2 3 7 6)
            (0 4 7 3)
        );
    }
    symmetryWalls
    {
        type symmetry;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
        );
    }
);


// ************************************************************************* //
